{"/leidbeiningar/":{"data":{"":"Velkomin í hlutann um prentunarleiðbeiningar. Hér finnur þú ítarlegar leiðbeiningar og bestu starfsvenjur til að hjálpa þér að ná sem bestum árangri við þrívíddarprentun á Autodarts íhlutunum þínum.\nAllt frá því að velja rétta prentunarefnið til að kvarða prentarann þinn, þessar leiðbeiningar eru hér til að hjálpa þér að ná árangri."},"title":"Prentunarleiðbeiningar"},"/leidbeiningar/velja-prentunarefni/":{"data":{"":"","að-velja-rétta-prentunarefnið-fyrir-autodarts-íhluti#Að velja rétta prentunarefnið fyrir Autodarts íhluti":"Að velja rétta prentunarefnið fyrir Autodarts íhluti Þegar þú prentar íhluti fyrir Autodarts kerfið þitt er val á prentunarefni mikilvægt til að tryggja endingu og prentgæði. Tvö algengustu og ráðlögðu efnin eru PLA og PETG.\nPLA (Polylactic Acid) PLA er vinsælasta þrívíddarprentunarefnið af góðri ástæðu. Það er auðvelt í prentun, á viðráðanlegu verði og fæst í fjölmörgum litum.\n3dverk.is hefur mikið úrval af efni til prentunar og þá aukahluti sem vantar.\nKostir:\nMjög auðvelt að prenta með lágmarks vindi (e. warping). Góð smáatriði og yfirborðsáferð. Stíft og óbeygjanlegt, sem er frábært fyrir festingar. Umhverfisvænt (lífbrjótanlegt). Gallar:\nMinna hitaþol. Ef kerfið þitt er í heitu umhverfi (eins og bílskúr á sumrin eða í beinu sólarljósi) gæti það afmyndast. Stökkara en PETG. Ráðlegging: Fyrir flestar uppsetningar innandyra er PLA frábær og hagkvæmur kostur.\nPETG (Polyethylene Terephthalate Glycol) PETG er frábær valkostur við PLA og býður upp á meiri endingu og hitaþol.\nKostir:\nEndingarbetra og minna stökkt en PLA. Meira hitaþol. Gott efnaþol. Gallar:\nGetur verið erfiðara í prentun, krefst oft hærra hitastigs og nákvæmra inndráttarstillinga (retraction) til að forðast þræði (stringing). Getur verið dýrara en PLA. Ráðlegging: Ef pílukerfið þitt er á svæði með miklum hitasveiflum eða ef þú vilt hámarksendingu fyrir íhlutina þína, er PETG betri kosturinn.\nNiðurstaða Fyrir byrjendur og venjulega notkun innandyra, byrjaðu á PLA. Ef þú lendir í vandræðum með að íhlutir brotni eða vindi sig vegna hita, eða ef þú ert vanur prentari sem leitar að sterkari lausn, notaðu PETG."},"title":"Að velja rétta prentunarefnið"},"/myndir/":{"data":{"":"Hér er safn mynda af verkefnum sem hafa verið prentuð. Smelltu á mynd til að sjá hana stærri. "},"title":"Myndir af kláruðum verkefnum"},"/stl-skrar/":{"data":{"":"Hér getur þú fundið allar nauðsynlegar STL skrár fyrir Autodarts kerfið þitt. Hver skrá hefur sína eigin síðu með prentunarráðleggingum og niðurhalstengli.\nSmelltu á einhvern af hlutunum hér til hliðar til að fá frekari upplýsingar og niðurhalstengil."},"title":"STL Skrár"},"/stl-skrar/myndavelafesting/":{"data":{"":"","plasma-myndavélafesting-fyrir-autodarts#Plasma myndavélafesting fyrir Autodarts":"Plasma myndavélafesting fyrir Autodarts Þetta er “Plasma” festingin, vinsæll valkostur sem er hannaður til að sitja beint á píluborðinu og veitir stöðugt og gott sjónarhorn fyrir myndavélarnar.\nFullgerð myndavélafesting Mynd fengin frá opinberu Autodarts DIY síðunni\nPrentunarráðleggingar Efni: PLA eða PETG Lagahæð: 0.2mm Fylling (Infill): 20% Stuðningur (Supports): Gæti þurft stuðning fyrir myndavélarhaldarann (Cam Holder), fer eftir prentara. Niðurhal Þú getur sótt allar STL skrár fyrir Plasma festinguna á GitHub síðu Autodarts: Sækja Plasma Mount skrár á GitHub\nFrekari upplýsingar Fyrir fleiri hönnunarmöguleika og upplýsingar, skoðaðu opinberu Autodarts DIY síðuna: autodarts.diy/3d-printing/"},"title":"Plasma myndavélafesting"},"/um/":{"data":{"":" More Later :) bensi@alit.is "},"title":"alit.is"}}