{"/docs/o365/":{"data":{"":"Certainly! Here’s the list with a brief description for each:\nAnonymous Link Usage Report\nProvides details on the usage and activity of anonymous sharing links in your environment. Archived Mailbox Size Overview\nSummarizes the size of archived mailboxes to help manage storage and compliance. Track Email Deletions in Office 365\nAudits and reports on deleted emails to monitor potential data loss or policy breaches. Monitor External User Actions\nTracks activities performed by external users within your Microsoft 365 environment. Track File Access in SharePoint Online\nAudits access events on files stored in SharePoint Online, ensuring data security. File Activity Log in SharePoint Online\nProvides a detailed log of all file-related activities in SharePoint Online. File Deletion Audit\nMonitors and reports on file deletion activities to prevent unauthorized data removal. File Download Monitoring in SharePoint Online\nTracks file download actions in SharePoint Online for data leakage prevention. Group Membership Change Audit\nAudits changes to group memberships, tracking additions and removals. Admin Activity Report in Microsoft 365\nSummarizes actions taken by administrators across the Microsoft 365 environment. New User Creation Audit in Microsoft 365\nLogs and reviews the creation of new user accounts for compliance and security. Mailbox Permission Change Audit\nTracks changes to mailbox permissions, ensuring access is controlled and documented. Teams Channel Creation Audit\nAudits the creation of new channels in Microsoft Teams, monitoring collaboration spaces. Teams Membership Change Log\nRecords membership changes in Microsoft Teams, including additions and removals. External Sharing Activity in Office 365\nMonitors sharing activities with external users, ensuring that data is shared securely. User Activity Report in Office 365\nProvides an overview of user activities within Office 365, helping to track engagement and compliance. Recently Created User Audit in Microsoft 365\nLists recently created users, allowing for a quick review of new account setups. Send As Email Monitoring\nTracks and logs emails sent on behalf of other users, ensuring proper delegation. SharePoint Group Membership Changes\nAudits changes in SharePoint group memberships to manage access control. Teams Meeting Activity Report\nReports on the usage and attendance of Microsoft Teams meetings. Automated Offboarding for Microsoft 365 Users\nAutomates the process of deactivating and removing users who have left the organization. Deploy Outlook Signature Automatically\nAutomatically deploys and manages email signatures across the organization. Azure AD Device Report\nProvides a summary of devices registered in Azure Active Directory. Check MFA Status for Users via MS Graph\nReviews per-user Multi-Factor Authentication (MFA) status using Microsoft Graph API. Configure Outlook Email Signature\nHelps configure email signatures in Outlook for consistent branding. Connect to Microsoft Graph PowerShell\nScript to establish a connection to Microsoft Graph via PowerShell. Automate Azure App Registration with Certificate for MS Graph\nAutomates the Azure app registration process using certificates for secure MS Graph connections. Connect to All Office 365 Services via PowerShell\nA comprehensive script to connect to various Office 365 services using PowerShell. Exchange Online PowerShell Connection Script\nScript to connect securely to Exchange Online via PowerShell. Convert Distribution Lists to Microsoft 365 Groups\nTool for converting traditional distribution lists into Microsoft 365 groups. Bulk Convert User Mailboxes to Shared Mailboxes\nAutomates the process of converting multiple user mailboxes into shared mailboxes. Delete Old Emails in Outlook\nScript to identify and delete older emails in Outlook to free up storage. Disable M365 Self-Service Purchases\nDisables the ability for users to make self-service purchases in Microsoft 365. Enable Mailbox Auditing for Office 365\nEnsures mailbox auditing is enabled for all users to track and monitor email activities. Enforce MFA for Admin Accounts\nScript to enforce Multi-Factor Authentication for administrator accounts. Export Conditional Access Policies\nExports Conditional Access policies for review or documentation purposes. Download Entra Sign-in Logs\nRetrieves sign-in logs from Entra to monitor access and potential security incidents. Mailbox Hold Status Export\nExports details of mailboxes on hold, helping with eDiscovery and compliance. Mailbox Usage and Quota Report Export\nGenerates reports on mailbox usage and quota status for storage management. Export MFA Status via MS Graph\nExtracts MFA status information for users using Microsoft Graph. Export Non-audited Mailbox Actions\nIdentifies and exports actions in mailboxes that have not been audited. Export Office 365 Group Memberships\nExports membership details of Office 365 groups for review and management. OneDrive URLs and Usage Size Export\nExtracts OneDrive URLs along with their usage sizes for storage management. Shared Channel Members Report Export\nExports a report of members in shared Microsoft Teams channels. Export SharePoint External Users\nGenerates a report of external users with access to SharePoint Online. SharePoint File and Folder Storage Report\nDetails storage consumption by files and folders in SharePoint Online. Set External Email Warning Rule\nConfigures a warning rule to alert users when they receive emails from external sources. File Version History Report\nProvides a detailed report on the version history of files in SharePoint. Identify Expired Anonymous Links\nIdentifies and reports on expired anonymous sharing links. Find Inactive Distribution Lists\nLocates and reports on distribution lists that are no longer active. Identify External Email Forwarding Rules\nSearches for inbox rules that automatically forward emails to external addresses. User License Assignment Path Report\nShows the license assignment path for users, helping manage licensing. Orphaned Teams Identification\nIdentifies Microsoft Teams that no longer have active owners or members. Track Teams Meetings for Specific Users\nAudits Microsoft Teams meetings attended by a specific user. Shared Mailbox Sent Emails Report\nMonitors and reports on emails sent from shared mailboxes. Get All Office 365 Email Addresses\nRetrieves a list of all email addresses in your Office 365 environment. List All SharePoint Subsites\nProvides a comprehensive list of all subsites within your SharePoint Online environment. Calendar Permission Report\nDetails the permissions set on users’ calendars in your organization. User Distribution List Membership Report\nSummarizes the distribution lists that a specific user is a member of. Report on Inactive Microsoft 365 Users\nIdentifies users in Microsoft 365 who have been inactive for a specified period. Auto Reply Configuration Report for Mailboxes\nReports on the auto-reply settings configured in user mailboxes. Mailbox Folder Permission Overview\nAudits and reports on the permissions assigned to folders within mailboxes. Mailbox Folder Statistics Report\nProvides statistical information on the contents of mailbox folders. Direct Memberships Report for Microsoft Users\nLists direct memberships of users in groups, directory roles, and administrative units. Nested Distribution List Membership Report\nDetails the nested distribution lists a user is part of, including group hierarchies. Office 365 Group Storage Report\nReports on the storage usage of Office 365 Groups. Self-Service Password Reset Status Report\nMonitors and reports on the status of self-service password reset configurations. Guest User Summary Report\nSummarizes the guest users in your environment, including their access levels. Guest User Last Logon Report\nReports on the last logon times of guest users, helping to identify stale accounts. Block External Email Forwarding in Exchange Online\nIdentifies and blocks external email forwarding rules to enhance security. Remove Overlapping Licenses for Group-licensed Users\nIdentifies and removes duplicate licenses for users who receive licenses from multiple groups. MFA Deployment Source Identification\nIdentifies the source of MFA deployment for users, whether it’s per-user or Conditional Access. Install and Connect to Exchange Online\nScript to install and establish a connection to Exchange Online via PowerShell. Last Sign-in Date Report for Microsoft 365 Users\nProvides the last sign-in dates for users, useful for identifying inactive accounts. License Expiry Date Report\nSummarizes the expiry dates of licenses assigned to users. MFA Authentication Methods Report\nLists the MFA authentication methods registered by users. **Accessible"},"title":"O365"}}